In [120]:
testString = 'C:\ \n Windows'

In [122]:
testString

'C:\\ \n Windows'

In [42]:
testString.replace(r'\'',r'\'\'')

"some''String''"

In [3]:
value = "Some'thing"

In [4]:
str(value).replace("'","''")

"Some''thing"

In [5]:
test_list = ["one","two","three","Some'thing"]

In [6]:
[str(value).replace("'","''") for value in test_list]

['one', 'two', 'three', "Some''thing"]

In [8]:
import pandas as pd

In [96]:
test_df = pd.DataFrame({'Column_1':['Stanley','Leonhard','Setiawan',None],
                        'Column_2':['22','This is it','random',None],
                        'Column_3':['11/22/2017','12/20/2018','09/05/2020',None],
                        'Column_4':['10/27/2015','12/15/2016','10/31/2015',None]})

test_df['Column_5'] = pd.Series(['Jan','Feb','Mar',None])
test_df['Column_6'] = pd.Series(['January','February','March',None])
test_df['Column_7'] = [22,None,'',None]
test_df['Column_8'] = [3.5,0.05,999.4,None]
test_df['Column_9'] = ['15:00','03:00','09:00',None]
test_df['Column_10'] = ['   ',' stanley this ',' ',"\t\n''some'String"]

In [45]:
def replaceSingleQuote(someString):
    return someString.replace("'","''")

In [127]:
def insertValuesQueryString(dbName,schema,tableName,dataframe):
    
    # get a list of columnNames from dataframe
    columnNamesList = ','.join([f'"{columnName}"' for columnName in dataframe.columns]) 
    queryString = f'INSERT INTO {dbName}.{schema}.{tableName} ({columnNamesList}) \n VALUES \n' 
    
    for index,*values in dataframe.itertuples():
#         queryString += '(' + ','.join([f"'{replaceSingleQuote(str(value))}'" if str(value) != 'NULL' else 'NULL' 
#                                        for value in values]) + '),\n'

        queryString += '(' + ','.join(["'" + str(value).replace("'","''") + "'" 
                                       if str(value) != 'NULL' else 'NULL' 
                                       for value in values]) + '),\n'
#         if index == dataframe.index[-1]:
#             queryString += '(' + ','.join([f"'{str(value).replace()}'" if str(value) != 'NULL' else 'NULL'
#                                            for value in values]) + ')'
#         else:
#             queryString += '(' + ','.join([f"'{str(value)}'" if str(value) != 'NULL' else 'NULL' 
#                                            for value in values]) + '),\n'
    return queryString

In [17]:
dbName = 'MBAN'
schema = 'dbo'
tableName = 'testTable'

In [125]:
test_df

,Column_1,Column_2,Column_3,Column_4,Column_5,Column_6,Column_7,Column_8,Column_9,Column_10
0,Stanley,22,11/22/2017,10/27/2015,Jan,January,22,3.5,15:00,NULL
1,Leonhard,This is it,12/20/2018,12/15/2016,Feb,February,NULL,0.05,03:00,stanley this
2,Setiawan,random,09/05/2020,10/31/2015,Mar,March,NULL,999.4,09:00,NULL
3,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,\t\n''some'String

In [124]:
print(insertValuesQueryString(dbName,schema,tableName,test_df))

INSERT INTO MBAN.dbo.testTable ("Column_1","Column_2","Column_3","Column_4","Column_5","Column_6","Column_7","Column_8","Column_9","Column_10")
 VALUES
('Stanley','22','11/22/2017','10/27/2015','Jan','January','22','3.5','15:00',NULL),
('Leonhard','This is it','12/20/2018','12/15/2016','Feb','February',NULL,'0.05','03:00',' stanley this '),
('Setiawan','random','09/05/2020','10/31/2015','Mar','March',NULL,'999.4','09:00',NULL),
(NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'
''''some''String'),

In [21]:
for index, *values in test_df.itertuples():
    print(index,values)

0 ['Stanley', '22', '11/22/2017', '10/27/2015', 'Jan', 'January', 22, 3.5, '15:00', '   ']
1 ['Leonhard', 'This is it', '12/20/2018', '12/15/2016', 'Feb', 'February', None, 0.05, '03:00', ' stanley this ']
2 ['Setiawan', 'random', '09/05/2020', '10/31/2015', 'Mar', 'March', '', 999.4, '09:00', ' ']
3 [None, None, None, None, None, None, None, nan, None, "some'String"]

In [92]:
print(r'\')

SyntaxError: EOL while scanning string literal (<ipython-input-92-84352fdd17be>, line 1)

In [95]:
test_string = r'\'

SyntaxError: EOL while scanning string literal (<ipython-input-95-cf3b6d4d7daf>, line 1)

In [100]:
import numpy as np

In [101]:
indexes = np.where((test_df.isna()) |  
                    (test_df == '') |
                    (test_df.apply(lambda row: row.str.isspace(), axis = 1)))

for rowNum,colNum in zip(indexes[0],indexes[1]):
    test_df.iloc[rowNum,colNum] = 'NULL'

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\ops\array_ops.py:253: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  res_values = method(rvalues)

In [102]:
test_df

,Column_1,Column_2,Column_3,Column_4,Column_5,Column_6,Column_7,Column_8,Column_9,Column_10
0,Stanley,22,11/22/2017,10/27/2015,Jan,January,22,3.5,15:00,NULL
1,Leonhard,This is it,12/20/2018,12/15/2016,Feb,February,NULL,0.05,03:00,stanley this
2,Setiawan,random,09/05/2020,10/31/2015,Mar,March,NULL,999.4,09:00,NULL
3,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,\t\n''some'String

In [103]:
print(insertValuesQueryString(dbName,schema,tableName,test_df))

INSERT INTO MBAN.dbo.testTable ("Column_1","Column_2","Column_3","Column_4","Column_5","Column_6","Column_7","Column_8","Column_9","Column_10")
 VALUES
('Stanley','22','11/22/2017','10/27/2015','Jan','January','22','3.5','15:00',NULL),
('Leonhard','This is it','12/20/2018','12/15/2016','Feb','February',NULL,'0.05','03:00',' stanley this '),
('Setiawan','random','09/05/2020','10/31/2015','Mar','March',NULL,'999.4','09:00',NULL),
(NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'
''''some''String'),

In [128]:
anotherString = '\n \n \t someString'

In [129]:
anotherString

'\n \n \t someString'

In [130]:
print(anotherString)

 	 someString

In [132]:
[character for character in anotherString]

['\n',
 ' ',
 '\n',
 ' ',
 '\t',
 ' ',
 's',
 'o',
 'm',
 'e',
 'S',
 't',
 'r',
 'i',
 'n',
 'g']

In [135]:
print(r'\n' + r'\t')

\n\t

In [152]:
print('AU\\norman.bates')

AU\norman.bates

In [154]:
print('c:/programfiles/n\'')

c:/programfiles/n'

In [191]:
testString = 'c:\\programfiles\n\''

In [192]:
print(testString)

c:\programfiles
'

In [193]:

translationTable = testString.maketrans({"\\":"\\\\",
                                          "'":"''"})
transformedString = testString.translate(translationTable)
print(transformedString)

c:\\programfiles
''

In [198]:
print(testString.replace('\+','\\'))

c:\programfiles
'

In [199]:
testString

"c:\\programfiles\n'"

In [203]:
print(repr(testString))

"c:\\programfiles\n'"

In [223]:
another_string = 'C:\\Windowsx\\\nstanley'

In [216]:
print(r'C:\\Windows\Users\alexb\')

SyntaxError: EOL while scanning string literal (<ipython-input-216-ab519461dc4d>, line 1)

In [224]:
another_string

'C:\\Windowsx\\\nstanley'

In [225]:
print(another_string)

C:\Windowsx\
stanley

In [226]:
print(r'%s' %another_string)

C:\Windowsx\
stanley

In [ ]:
another_

In [230]:
raw_string = r"{}".format(another_string)

In [233]:
another_string

'C:\\Windowsx\\\nstanley'

In [238]:
[character.replace('') for character in another_string]

['C',
 ':',
 '\\',
 'W',
 'i',
 'n',
 'd',
 'o',
 'w',
 's',
 'x',
 '\\',
 '\n',
 's',
 't',
 'a',
 'n',
 'l',
 'e',
 'y']

In [240]:
test_df.to_csv('test_df',index=False)

In [241]:
test_df

,Column_1,Column_2,Column_3,Column_4,Column_5,Column_6,Column_7,Column_8,Column_9,Column_10
0,Stanley,22,11/22/2017,10/27/2015,Jan,January,22,3.5,15:00,NULL
1,Leonhard,This is it,12/20/2018,12/15/2016,Feb,February,NULL,0.05,03:00,stanley this
2,Setiawan,random,09/05/2020,10/31/2015,Mar,March,NULL,999.4,09:00,NULL
3,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,\t\n''some'String

In [242]:
another_df = pd.read_csv('test.csv')

In [243]:
another_df

,Column_1,Column_2,Column_3,Column_4,Column_5,Column_6,Column_7,Column_8
0,Stanley,22,11/22/2017,10/27/2015,Jan,January,22,3.50
1,Leonhard,This is it,12/20/2018,12/15/2016,Feb,February,25,0.05
2,Setiawwan,random,09/05/2020,27/10/2015,Mar,March,\t \n stanley'setiawan,999.40

In [246]:
print(another_df.loc[2,'Column_7'])

\t \n stanley'setiawan

In [247]:
another_df.loc[2,'Column_7']

"\\t \\n stanley'setiawan"

In [250]:
folderOwner = pd.DataFrame({'path':['C:\ProgramFiles\folder_1','C:\ProgramData\folder_2'],
                           'owner':['stanley','Tony']})

In [252]:
print(folderOwner)

                      path    owner
0  C:\ProgramFilesolder_1  stanley
1   C:\ProgramDataolder_2     Tony